ruby/rails/blog_demo/app/controllers/posts_controller.rb

UPDATE "posts" SET "updated_at" = ?, "views" = ? WHERE "posts"."id" = ?  [["updated_at", "2022-07-08 13:50:13.613954"], ["views", 1], ["id", 1]]
---
  def show
    @post.update(views: @post.views + 1)